cases/catalyticSimpleFOAM_v0.1/Case02/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 473.15; 


boundaryField
{
    reactingWall
    {
        type            fixedValue;
        value        	uniform 473.15;
    }
    inertWall
    {
        type            fixedValue;
	value		uniform 473.15;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 473.15;
    }
    outlet
    {
	type            inletOutlet;
        inletValue      uniform 473.15;
        value           uniform 473.15;
    }
}


// ************************************************************************* //
